In [59]:
import pandas as pd

In [13]:
df = pd.read_csv('emp.csv')

In [17]:
# type of df varaiable
type(df)

pandas.core.frame.DataFrame

In [18]:
# print the content of dataframe df
df

   eno      ename       city
0    1       Adam   New York
1    2     Thomas     London
2    3      Smith  Singapore
3    4      Maria   New York
4    5  Christian   New York
5    6     Pankaj  Bangalore

In [19]:
# Read ename column from the dataframe df
df['ename']

0         Adam
1       Thomas
2        Smith
3        Maria
4    Christian
5       Pankaj
Name: ename, dtype: object

In [20]:
# Read ename and city columns from the dataframe df
df[['ename','city']]

       ename       city
0       Adam   New York
1     Thomas     London
2      Smith  Singapore
3      Maria   New York
4  Christian   New York
5     Pankaj  Bangalore

In [21]:
# anothe way to Read ename and city columns from the dataframe df
column_list = ['ename','city']

In [23]:
# store the output in dataframe ( target_df )
target_df = df[column_list]

In [24]:
# Print the dataframe
target_df

       ename       city
0       Adam   New York
1     Thomas     London
2      Smith  Singapore
3      Maria   New York
4  Christian   New York
5     Pankaj  Bangalore

In [26]:
# Write the content of dataframe (target_df) to csv file (target_emp.csv) without indexes
target_df.to_csv('target_emp.csv',index=False)

In [40]:
# read a pipe seperated file
df_pipeFile = pd.read_csv('emp_copy.csv',delimiter='|')

In [41]:
# print the dataframe (df_pipeFile)
df_pipeFile

   eno      ename       city
0    1       Adam   New York
1    2     Thomas     London
2    3      Smith  Singapore
3    4      Maria   New York
4    5  Christian   New York
5    6     Pankaj  Bangalore

In [46]:
# To read only selected columns from the file
df_selected_column = pd.read_csv('emp.csv',usecols=['eno','city'])

In [47]:
# print dataframe ( df_selected_column )
df_selected_column

   eno       city
0    1   New York
1    2     London
2    3  Singapore
3    4   New York
4    5   New York
5    6  Bangalore

In [55]:
# To mark eno as a primary key ( index column)
df_index_column = pd.read_csv('emp.csv',usecols=['eno','city'],index_col='eno')

In [56]:
df_index_column

          city
eno
1     New York
2       London
3    Singapore
4     New York
5     New York
..         ...
2       London
3    Singapore
4     New York
5     New York
6    Bangalore

[2311 rows x 1 columns]

In [63]:
df

         eno|ename|city
0       1|Adam|New York
1       2|Thomas|London
2     3|Smith|Singapore
3      4|Maria|New York
4  5|Christian|New York
5    6|Pankaj|Bangalore

In [75]:
# chunksize for reading files in small chunk
for chunk in pd.read_csv('emp.csv',chunksize=5):
    print(chunk)

   eno      ename       city
0    1       Adam   New York
1    2     Thomas     London
2    3      Smith  Singapore
3    4      Maria   New York
4    5  Christian   New York
   eno   ename       city
5    6  Pankaj  Bangalore
6    1    Adam   New York
7    2  Thomas     London
8    3   Smith  Singapore
9    4   Maria   New York
    eno      ename       city
10    5  Christian   New York
11    6     Pankaj  Bangalore

In [74]:
df_emp

In [80]:
# read line no 10 to 20 from the file

df = pd.read_csv('emp.csv',skiprows=9,nrows=11,names=['eno','ename','city'])

In [81]:
df

    eno      ename       city
0    1a      Smith  Singapore
1     4      Maria   New York
2     5  Christian   New York
3     6     Pankaj  Bangalore
4     5  Christian   New York
5     6     Pankaj  Bangalore
6     1       Adam   New York
7     2     Thomas     London
8     3      Smith  Singapore
9     4      Maria   New York
10  20a  Christian   New York

In [82]:
type(df)

pandas.core.frame.DataFrame

In [83]:
df = pd.read_csv('emp.csv')

In [86]:
df1 = df[['eno','ename']]

In [87]:
type(df1)

pandas.core.frame.DataFrame

In [88]:
df2 = df['eno']

In [89]:
type(df2)

pandas.core.series.Series